In [142]:
import pandas as pd

In [191]:
df = pd.DataFrame(data=[
    [22, 70, 170, 100],
    [10, 30, 100, 40],
    [15, 50, 150, 50],
])

df.index
df.columns

df.loc[:, 0]
df.iloc[:, 0]

df.loc[0, 0]
df.iloc[0, 0]

df

RangeIndex(start=0, stop=3, step=1)

RangeIndex(start=0, stop=4, step=1)

0    22
1    10
2    15
Name: 0, dtype: int64

0    22
1    10
2    15
Name: 0, dtype: int64

np.int64(22)

np.int64(22)

    0   1    2    3
0  22  70  170  100
1  10  30  100   40
2  15  50  150   50

In [198]:
df = pd.DataFrame(data=[
    [22, 70, 170, 100],
    [10, 30, 100, 40],
    [15, 50, 150, 50],
], columns=['Age', 'Weight', 'Height', 'Marks'])

df.index
df.columns

df.loc[:, 'Age']
df.iloc[:, 0]

df.loc[0, 'Age']
df.iloc[0, 0]

df

RangeIndex(start=0, stop=3, step=1)

Index(['Age', 'Weight', 'Height', 'Marks'], dtype='object')

0    22
1    10
2    15
Name: Age, dtype: int64

0    22
1    10
2    15
Name: Age, dtype: int64

np.int64(22)

np.int64(22)

   Age  Weight  Height  Marks
0   22      70     170    100
1   10      30     100     40
2   15      50     150     50

In [205]:
df = pd.DataFrame(data=[
    [22, 70, 170, 100],
    [10, 30, 100, 40],
    [15, 50, 150, 50],
], columns=['Age', 'Weight', 'Height', 'Marks'],
    index=['rahul', 'vishnu', 'paru'])

df.index
df.columns

df.loc[['rahul', 'vishnu'], 'Age']
df.iloc[[0, 1], 0]

Index(['rahul', 'vishnu', 'paru'], dtype='object')

Index(['Age', 'Weight', 'Height', 'Marks'], dtype='object')

rahul     22
vishnu    10
Name: Age, dtype: int64

rahul     22
vishnu    10
Name: Age, dtype: int64

In [207]:
df = pd.read_csv('data/Week1_GA_dataset.csv')
df.sample(5)
df.shape

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
8004,2020-08-16,2020,Bridgeport,106940.0,100000.0,?,Detached House,3,3,1020.0,1.025440,East
2051,2012-05-06,2012,Bridgeport,186710.0,300000.0,?,Detached House,3,1,NaN,1.021958,South
6381,2018-07-01,2018,Waterbury,37060.0,45000.0,?,Detached House,3,1,1072.0,1.422308,North
4282,2015-10-17,2015,West Hartford,175350.0,225000.0,Single Family,Detached House,3,2,958.0,1.340225,East
5294,2017-01-28,2017,Fairfield,486560.0,400000.0,Single Family,Detached House,3,3,958.0,1.388283,North

(10000, 12)

In [224]:
df.iloc[::2].iloc[0, 3]

np.float64(111440.0)

In [227]:
df.iloc[::2].iloc[332, 3]

np.float64(256200.0)

In [237]:
df.iloc[1::2].iloc[332, 3]

np.float64(352940.0)

In [238]:
df.iloc[:, 1::2].iloc[100, 5]

'West'

In [240]:
df.iloc[::2, ::2].iloc[255, 3]

'Detached House'

In [251]:
df['Year'].value_counts().sort_index()[-6:].sum()

np.int64(4749)

In [256]:
df['Year'].value_counts().sort_index(ascending=False)[:6].sum()

np.int64(4749)

In [265]:
((df['num_rooms'] == 3) & (df['num_bathrooms'] == 3)).sum()

np.int64(2730)

In [269]:
((df['num_rooms'] == 3) | (df['num_bathrooms'] == 3)).sum()

np.int64(8591)

In [276]:
(
    (df['Year'] == 2022)
    & (df['Locality'] == 'Greenwich')
    & (df['num_rooms'] == 3)
    & (df['Face'].isin(['North', 'East']))
).sum()

np.int64(42)

In [289]:
(df['Date'].str[5:7] == '08').sum()

np.int64(1050)

In [312]:
grp = df.groupby('Locality')
# grp.groups.keys()
# grp.groups.values()
sales = grp['Sale Price'].mean()
sales.index[sales.argmax()]

'Greenwich'